20250630T192238--kdoc-412-ヒープ管理方法の変遷を見る__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-05T19:12:28Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 412: ヒープ管理方法の変遷を見る</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 412: ヒープ管理方法の変遷を見る</h1>
<div id="outline-container-orgeb4b604" class="outline-2">
<h2 id="orgeb4b604"><a href="#orgeb4b604">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgeb4b604">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-06-30 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-07-19 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgaaacfac" class="outline-2">
<h2 id="orgaaacfac"><a href="#orgaaacfac">概要</a></h2>
<div class="outline-text-2" id="text-orgaaacfac">
<p>
ヒープ管理方法の変遷を見る。柔軟性、安全性、パフォーマンスのトレードオフの歴史である。
</p>

<ol class="org-ol">
<li>従来はプログラマーが <code>malloc</code> や <code>free</code> でヒープを確保・解放していた
<ul class="org-ul">
<li>課題: メモリ解放忘れや解放済みのポインタへのアクセス。安全性に問題があった</li>
</ul></li>
<li>処理系にガベージコレクションを組み込み、メモリ管理を自動で行うようにした
<ul class="org-ul">
<li>課題: パフォーマンスへの影響、一時停止、管理の複雑さ</li>
</ul></li>
<li>所有権に基づいてメモリを管理する。コンパイル時にメモリ管理の正しさを検証し、実行時のオーバーヘッドなく安全性を得る
<ul class="org-ul">
<li>課題: リストなど特定のケースで実装が難しいことがあるという</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org951067a" class="outline-2">
<h2 id="org951067a"><a href="#org951067a">関連</a></h2>
<div class="outline-text-2" id="text-org951067a">
<ul class="org-ul">
<li><a href="https://ja.wikipedia.org/wiki/%E3%82%AC%E3%83%99%E3%83%BC%E3%82%B8%E3%82%B3%E3%83%AC%E3%82%AF%E3%82%B7%E3%83%A7%E3%83%B3">ガベージコレクション - Wikipedia</a></li>
<li><a href="20250630T185540--kdoc-411-スタックは積み重ねて取り出して解放する。ではヒープは__permanent.html#ID-20250630T185540">KDOC 411: スタックは積み重ねて取り出して解放する。ではヒープは?</a>。きっかけになった疑問</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
